[
    {
        "questionText": "Which African island nation boasts the unique title of being the world's largest coral atoll?",
        "answerOptions": [
            { "answerText": "Seychelles", "isCorrect": false },
            { "answerText": "Madagascar", "isCorrect": false },
            { "answerText": "Mauritius", "isCorrect": false },
            { "answerText": "Maldives", "isCorrect": true },
            { "answerText": "Cape Verde", "isCorrect": false }
        ],
        "explanation": "Comprised of over 1,190 coral islands strung across the Indian Ocean, the Maldives holds the crown as the world's largest coral atoll. This breathtaking archipelago offers white-sand beaches, crystal-clear waters, and a mesmerizing underwater world, making it a true paradise for island lovers."
    },
    {
        "questionText": "What is the name of the world's longest underwater barrier reef, stretching for over 2,300 kilometers along the Australian coast?",
        "answerOptions": [
            { "answerText": "Mesoamerican Barrier Reef", "isCorrect": false },
            { "answerText": "Great Barrier Reef", "isCorrect": true },
            { "answerText": "New Caledonia Barrier Reef", "isCorrect": false },
            { "answerText": "Red Sea Barrier Reef", "isCorrect": false },
            { "answerText": "Ningaloo Reef", "isCorrect": false }
        ],
        "explanation": "The Great Barrier Reef, a natural wonder teeming with marine life and vibrant coral formations, reigns supreme as the world's longest underwater barrier reef. This UNESCO World Heritage Site stretches for over 2,300 kilometers along the Australian coastline, offering a glimpse into the incredible biodiversity and ecological significance of coral reefs."
    },
    {
        "questionText": "Which European country boasts the most time zones, spanning across 24 due to its overseas territories?",
        "answerOptions": [
            { "answerText": "France", "isCorrect": true },
            { "answerText": "Spain", "isCorrect": false },
            { "answerText": "United Kingdom", "isCorrect": false },
            { "answerText": "Denmark", "isCorrect": false },
            { "answerText": "Russia", "isCorrect": false }
        ],
        "explanation": "While Russia may have the largest land area of any country, France takes the crown for the most time zones due to its extensive overseas territories scattered across the globe. From the Caribbean to the Indian Ocean, these diverse regions contribute to France's incredible geographic reach and cultural tapestry."
    },
    {
        "questionText": "What is the name of the world's largest hot desert, encompassing vast sand dunes and unforgiving landscapes?",
        "answerOptions": [
            { "answerText": "Sahara Desert", "isCorrect": true },
            { "answerText": "Arabian Desert", "isCorrect": false },
            { "answerText": "Gobi Desert", "isCorrect": false },
            { "answerText": "Australian Outback", "isCorrect": false },
            { "answerText": "Patagonian Desert", "isCorrect": false }
        ],
        "explanation": "The scorching sands of the Sahara Desert extend across 11 countries, making it the world's largest hot desert. From towering sand dunes to hidden oases, this ancient landscape paints a mesmerizing picture of resilience and stark beauty."
    },
    {
        "questionText": "Which South American city boasts the unique title of being the highest capital city in the world, perched over 3,600 meters above sea level?",
        "answerOptions": [
            { "answerText": "La Paz, Bolivia", "isCorrect": true },
            { "answerText": "Quito, Ecuador", "isCorrect": false },
            { "answerText": "Bogotá, Colombia", "isCorrect": false },
            { "answerText": "Lima, Peru", "isCorrect": false },
            { "answerText": "Rio de Janeiro, Brazil", "isCorrect": false }
        ],
        "explanation": "La Paz, Bolivia, holds the unique title of being the highest capital city in the world, perched over 3,600 meters above sea level. Nestled amidst mountainous terrain, it offers breathtaking views and a distinctive high-altitude experience."
    },
    {
        "questionText": "Which African nation boasts the unique title of being the world's largest island country by land area?",
        "answerOptions": [
            { "answerText": "Madagascar", "isCorrect": true },
            { "answerText": "Seychelles", "isCorrect": false },
            { "answerText": "Mauritius", "isCorrect": false },
            { "answerText": "Cape Verde", "isCorrect": false },
            { "answerText": "São Tomé and Príncipe", "isCorrect": false }
        ],
        "explanation": "Madagascar, nicknamed the 'Red Island' for its unique soil, stands as the world's largest island country by land area. This biodiversity hotspot, off the coast of East Africa, offers a kaleidoscope of landscapes, from rainforests and spiny deserts to volcanic peaks and idyllic beaches."
    },
    {
        "questionText": "What is the name of the world's longest river cave system, a labyrinthine network of passageways stretching for over 600 kilometers beneath the Earth's surface?",
        "answerOptions": [
            { "answerText": "Mammoth Cave System, Kentucky, USA", "isCorrect": false },
            { "answerText": "Sistema Huautla, Mexico", "isCorrect": true },
            { "answerText": "Phong Nha-Kẻ Bàng National Park, Vietnam", "isCorrect": false },
            { "answerText": "Waitomo Caves, New Zealand", "isCorrect": false },
            { "answerText": "Jeju Lava Tube, South Korea", "isCorrect": false }
        ],
        "explanation": "Hidden beneath the jungles of southern Mexico, Sistema Huautla boasts the title of the world's longest cave system. This labyrinthine network of passageways, carved by the relentless flow of subterranean rivers, offers a glimpse into the Earth's hidden depths and the complex ecosystems that thrive within."
    },
    {
        "questionText": "Which European capital city enjoys the longest average sunshine hours per year, making it a haven for sun-seekers?",
        "answerOptions": [
            { "answerText": "Madrid, Spain", "isCorrect": false },
            { "answerText": "Lisbon, Portugal", "isCorrect": true },
            { "answerText": "Athens, Greece", "isCorrect": false },
            { "answerText": "Rome, Italy", "isCorrect": false },
            { "answerText": "Paris, France", "isCorrect": false }
        ],
        "explanation": "Bask in the sunshine! Lisbon, bathed in over 3,000 hours of sunshine annually, takes the crown as the sunniest capital city in Europe. From picturesque beaches to vibrant cafes, this coastal gem offers a perfect blend of light, culture, and relaxation."
    },
    {
        "questionText": "What is the name of the world's largest active geyser field, a geothermal wonderland dotted with dozens of erupting hot springs and vibrant colors?",
        "answerOptions": [
            { "answerText": "Yellowstone National Park, USA", "isCorrect": false },
            { "answerText": "El Tatio Geyser Field, Chile", "isCorrect": false },
            { "answerText": "Taupo Volcanic Zone, New Zealand", "isCorrect": true },
            { "answerText": "Geysir geothermal area, Iceland", "isCorrect": false },
            { "answerText": "Kamchatka Peninsula, Russia", "isCorrect": false }
        ],
        "explanation": "New Zealand's Taupo Volcanic Zone, home to the iconic Orakei Korako and geothermal wonders like Wai-O-Tapu Thermal Wonderland, takes the title of the world's largest active geyser field. This geothermal playground offers a mesmerizing spectacle of bubbling mud pools, colorful terraces, and erupting geysers."
    },
    {
        "questionText": "Which Asian island nation boasts the unique distinction of being the world's largest archipelago by the number of islands, with over 17,000 scattered across its waters?",
        "answerOptions": [
            { "answerText": "Japan", "isCorrect": false },
            { "answerText": "Indonesia", "isCorrect": true },
            { "answerText": "Philippines", "isCorrect": false },
            { "answerText": "Vietnam", "isCorrect": false },
            { "answerText": "Sri Lanka", "isCorrect": false }
        ],
        "explanation": "With over 17,000 islands sprawling across the equator, Indonesia stands as the world's largest archipelago by sheer number. From volcanic peaks to pristine beaches, each island offers a unique glimpse into the incredible diversity and cultural richness of this Southeast Asian nation."
    }
]
